; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v8 - type_3 ?v4 - type_2)
 	      (pred_1 ?v2 - object ?v4 - type_2)
	      (pred_2 ?v8 - type_3 ?v6 - type_1)
	      (pred_3 ?v8 - type_3 ?v2 - object ?v6 - type_1))

   (:action op_2
       :parameters  (?v8 - type_3 ?v5 ?v1 - type_2)
       :precondition (and  (pred_4 ?v8 ?v5))
       :effect (and  (pred_4 ?v8 ?v1)
		     (not (pred_4 ?v8 ?v5))))

   (:action op_3
       :parameters (?v8 - type_3 ?v3 - object ?v7 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v3 ?v7) (pred_4 ?v8 ?v7) (pred_2 ?v8 ?v6))
       :effect (and (pred_3 ?v8 ?v3 ?v6)
		    (not (pred_1 ?v3 ?v7)) 
		    (not (pred_2 ?v8 ?v6))))

   (:action op_1
       :parameters (?v8 - type_3 ?v3 - object ?v7 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_3 ?v8 ?v3 ?v6) (pred_4 ?v8 ?v7))
       :effect (and (pred_1 ?v3 ?v7)
		    (pred_2 ?v8 ?v6)
		    (not (pred_3 ?v8 ?v3 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_08 - type_3
obj_07 obj_05 - type_1
obj_06 obj_02 obj_01 - type_2
obj_09 obj_04 obj_03 - object)
(:init
(pred_4 obj_08 obj_06)
(pred_2 obj_08 obj_07)
(pred_2 obj_08 obj_05)
(pred_1 obj_09 obj_06)
(pred_1 obj_04 obj_01)
(pred_1 obj_03 obj_01)
)
(:goal
(and
(pred_1 obj_09 obj_02)
(pred_1 obj_04 obj_02)
(pred_1 obj_03 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_08 ?b obj_05))))
)
)

; plan
1. (op_3 obj_08 obj_09 obj_06 obj_07)
   deleted: (pred_1 obj_09 obj_06) (pred_2 obj_08 obj_07)
   added: (pred_3 obj_08 obj_09 obj_07)
   goals met: 1 of 3
2. (op_2 obj_08 obj_06 obj_02)
   deleted: (pred_4 obj_08 obj_06)
   added: (pred_4 obj_08 obj_02)
   goals met: 1 of 3
3. (op_1 obj_08 obj_09 obj_02 obj_07)
   deleted: (pred_3 obj_08 obj_09 obj_07)
   added: (pred_1 obj_09 obj_02) (pred_2 obj_08 obj_07)
   goals met: 2 of 3
4. (op_2 obj_08 obj_02 obj_01)
   deleted: (pred_4 obj_08 obj_02)
   added: (pred_4 obj_08 obj_01)
   goals met: 2 of 3
5. (op_3 obj_08 obj_04 obj_01 obj_07)
   deleted: (pred_1 obj_04 obj_01) (pred_2 obj_08 obj_07)
   added: (pred_3 obj_08 obj_04 obj_07)
   goals met: 2 of 3
6. (op_2 obj_08 obj_01 obj_02)
   deleted: (pred_4 obj_08 obj_01)
   added: (pred_4 obj_08 obj_02)
   goals met: 2 of 3
7. (op_1 obj_08 obj_04 obj_02 obj_07)
   deleted: (pred_3 obj_08 obj_04 obj_07)
   added: (pred_1 obj_04 obj_02) (pred_2 obj_08 obj_07)
   goals met: 3 of 3
